# Homework 08

### ⚠️ Before you start ⚠️

_Duplicate this Jupyter Notebook in your `week-10` folder (right-click -> Duplicate) and then add your last name to the beginning of it (ie. `blevins-hw-08.ipynb` - otherwise you risk having all your work overwritten when you try to sync your GitHub repository with your instructor's repository._

---

## Overview

In this assignment, you'll synthesize some of the Python skills you've learned over the past month or so, including Pandas and Plotly. You'll be analyzing the opening of new businesses in Colorado during the 1940s.

Draw on the following tutorials:

- 💻 Walsh, [Pandas Basics Part 1](https://melaniewalsh.github.io/Intro-Cultural-Analytics/03-Data-Analysis/01-Pandas-Basics-Part1.html)
- 💻 Walsh, [Pandas Basics Part 2](https://melaniewalsh.github.io/Intro-Cultural-Analytics/03-Data-Analysis/02-Pandas-Basics-Part2.html)
- 💻 Walsh, [Pandas Basics Part 3](https://melaniewalsh.github.io/Intro-Cultural-Analytics/03-Data-Analysis/03-Pandas-Basics-Part3.html)
- 🐼 [Pandas Concepts](https://cblevins.github.io/sp25-data/modules/pandas-concepts/)
- 💻 [Introduction to Plotly](https://cblevins.github.io/sp25-data/modules/plotly-intro/)
- 💻 [Cleaning Excel Files](https://cblevins.github.io/sp25-data/modules/excel-cleaning/)

## The Data

First, get the necessary data files from our shared course repository:

- Open GitHub Desktop and select your course repository (`lastname-sp25-data-materials`)
- Click `Fetch origin` to check for updates
- Go to `Branch` → `Merge into current branch` → select `upstream/main` -> `Merge`
- Click `Push origin` to sync everything up
- Launch Jupyter Lab and navigate to the `week-10` folder

You should see a single Excel file that you will be working with: `co-new-businesses-1940s.xlsx`. Inside that Excel file, there are two separate sheets: `New CO Businesses` and `Cities 1940`.

- `New CO Businesses`: This is a subset of new businesses that were established in Colorado during the 1940s - a subset of data drawn from [this database](https://data.colorado.gov/Business/Business-Entities-in-Colorado/4ykn-tg5h/about_data).
- `Cities 1940`: this contains population statistics for Colorado cities in the 1940 Census.

### Import Libraries and Load Data

- Import the necessary libraries:

  - pandas (using the alias `pd`)
  - plotly.express (using the alias `px`)

In [7]:
import pandas as pd

In [8]:
import plotly.express as px

- Load both sheets from the Excel file:
  - Create a variable called `businesses_df` to store the "New CO Businesses" sheet in the Excel file
  - Create a variable called `cities_df` to store the "Cities 1940" sheet in the Excel file
  - Use `pd.read_excel()` with the appropriate parameters

In [10]:
businesses_df = pd.read_excel('co-new-businesses-1940s.xlsx', sheet_name='New CO Businesses')
cities_df = pd.read_excel('co-new-businesses-1940s.xlsx', sheet_name='Cities 1940')

### Familiarize Yourself with the Data

Familiarize yourself with the data:

- Display a sample of 10 rows from each dataframe.
- Check the data types for the columns in each dataframe

In [12]:
businesses_df.sample(10)

,entityid,Business entity name,Address,city,state,zip_code,Country,date_entity_formed,year_entity_formed
852,19871105908,"CEDAREDGE ROD AND GUN CLUB, INC.",18052 Green Valley Rd,CEDAREDGE,CO,81413.0,US,1941-01-24,1941
415,19871106835,SEVEN LAKES IRRIGATION COMPANY,NaN,NaN,NaN,NaN,NaN,1942-01-26,1942
854,19871164993,CARROLL OIL CO. INC.,2601 Champa St,Denver,CO,80205.0,US,1948-01-03,1948
700,19871115980,JACK PINE MINING COMPANY,1122 Colorado Blvd,Idaho Springs,CO,80452.0,US,1949-02-26,1949
79,19871025279,UNION CARBIDE CORPORATION,7501 State Highway 185 North,Seadrift,TX,77983.0,US,1949-12-30,1949
759,19871125730,"FIRST BAPTIST CHURCH OF HOTCHKISS, COLORADO",203 W MAIN STREET,HOTCHKISS,CO,81419.0,US,1947-10-24,1947
307,19401105513,"A & C MOTOR CO., Dissolved January 31, 1977",NaN,NaN,NaN,NaN,NaN,1940-08-08,1940
805,19871229176,COVENANT HEIGHTS CONFERENCE CENTER,1580 N Logan St Ste 660,Denver,CO,80203.0,US,1946-12-10,1946
9,19871113871,"BOW-MAR OWNERS, INC.",5380 Lakeshore Dr,Littleton,CO,80123.0,US,1948-01-12,1948
31,19871007390,UNITED HERITAGE LIFE INSURANCE COMPANY,707 E United Heritage CT,Meridian,ID,83642.0,US,1945-07-11,1945

In [13]:
businesses_df.dtypes

entityid                  int64
Business entity name     object
Address                  object
city                     object
state                    object
zip_code                float64
Country                  object
date_entity_formed       object
year_entity_formed        int64
dtype: object

In [14]:
cities_df.sample(10)

               city  year  total population
124           limon  1940              1053
5            arvada  1940              1482
45       deer trail  1940               387
55            eaton  1940              1322
1           alamosa  1940              5613
60        englewood  1940              9680
85   grand junction  1940             12479
141     monte vista  1940              3208
30           cheraw  1940               184
190    silver cliff  1940               309

In [15]:
cities_df.dtypes

city                object
year                 int64
total population     int64
dtype: object

## Data Cleaning and Preparation

### Cleaning column names

For both datasets, you want to clean and standardize the column names (headers):

- Change column names to all lowercase
- Replace any whitespace with an underscore (`_`) - ex. `some column` becomes `some_column`
- _Hint: Use `str.lower()` and `str.replace()`_
- Show the first 10 rows of your dataframe to make sure it worked

In [17]:
businesses_df.columns = [col.strip().lower().replace('   ', '_').replace(' ', '_') for col in businesses_df.columns]
cities_df.columns = [col.strip().lower().replace('_', '').replace(' ', '_') for col in cities_df.columns]

In [18]:
businesses_df.head(10)

,entityid,business_entity_name,address,city,state,zip_code,country,date_entity_formed,year_entity_formed
0,19871004753,ALAMOSA CREDIT UNION,2437 MAIN ST,ALAMOSA,CO,81101.0,US,1945-03-27,1945
1,19871241137,THE UNITED METHODIST CHURCH OF STEAMBOAT SPRINGS,736 OAK ST,STEAMBOAT SPRINGS,CO,80487.0,US,1949-03-09,1949
2,19871275274,ALLIED JEWISH FEDERATION OF COLORADO,300 S. Dahlia St.,DENVER,CO,80246.0,US,1946-05-23,1946
3,19871127721,"Iglesia CRISTO REY + Christ the King, ELCA",2300 S Patton Ct,Denver,CO,80219.0,US,1945-09-06,1945
4,19871117433,"LYNCH-COTTEN POST NO. 190, THE AMERICAN LEGION",425 Highway 92,Crawford,CO,81415.0,US,1949-12-30,1949
5,19871105155,THE BEAR RIVER VALLEY FARMERS COOPERATIVE,193 E Jefferson Ave,Hayden,CO,81639.0,US,1940-03-22,1940
6,19871162072,Belmar Baptist Church,460 S Kipling St,Lakewood,CO,80226.0,US,1943-08-20,1943
7,19871110810,"Bethel Lutheran Church of Windsor, Colorado",328 Walnut St,Windsor,CO,80550.0,US,1946-05-24,1946
8,19871116977,"BLACKINTON AND DECKER, INC., Delinquent Novemb...",424 LIPAN,DENVER,CO,80204.0,US,1946-05-20,1946
9,19871113871,"BOW-MAR OWNERS, INC.",5380 Lakeshore Dr,Littleton,CO,80123.0,US,1948-01-12,1948

In [19]:
cities_df.head(10)

       city  year  total_population
0     akron  1940              1417
1   alamosa  1940              5613
2      alma  1940               469
3  antonito  1940              1220
4    arriba  1940               286
5    arvada  1940              1482
6     aspen  1940               777
7    aurora  1940              3437
8    basalt  1940               212
9  bayfield  1940               372

### Standardize and clean data for cities

- Standardize city names in the business data so that it **removes any trailing or leading whitespace** and **changes the values to all lowercase** (hint: use `.str.strip()` and `.str.lower()`)
- Show the first 10 rows of your dataframe to make sure it worked

In [21]:
businesses_df['city'] = businesses_df['city'].str.strip().str.title()
cities_df['city'] = cities_df['city'].str.strip().str.title()

In [22]:
businesses_df.head(10)

,entityid,business_entity_name,address,city,state,zip_code,country,date_entity_formed,year_entity_formed
0,19871004753,ALAMOSA CREDIT UNION,2437 MAIN ST,Alamosa,CO,81101.0,US,1945-03-27,1945
1,19871241137,THE UNITED METHODIST CHURCH OF STEAMBOAT SPRINGS,736 OAK ST,Steamboat Springs,CO,80487.0,US,1949-03-09,1949
2,19871275274,ALLIED JEWISH FEDERATION OF COLORADO,300 S. Dahlia St.,Denver,CO,80246.0,US,1946-05-23,1946
3,19871127721,"Iglesia CRISTO REY + Christ the King, ELCA",2300 S Patton Ct,Denver,CO,80219.0,US,1945-09-06,1945
4,19871117433,"LYNCH-COTTEN POST NO. 190, THE AMERICAN LEGION",425 Highway 92,Crawford,CO,81415.0,US,1949-12-30,1949
5,19871105155,THE BEAR RIVER VALLEY FARMERS COOPERATIVE,193 E Jefferson Ave,Hayden,CO,81639.0,US,1940-03-22,1940
6,19871162072,Belmar Baptist Church,460 S Kipling St,Lakewood,CO,80226.0,US,1943-08-20,1943
7,19871110810,"Bethel Lutheran Church of Windsor, Colorado",328 Walnut St,Windsor,CO,80550.0,US,1946-05-24,1946
8,19871116977,"BLACKINTON AND DECKER, INC., Delinquent Novemb...",424 LIPAN,Denver,CO,80204.0,US,1946-05-20,1946
9,19871113871,"BOW-MAR OWNERS, INC.",5380 Lakeshore Dr,Littleton,CO,80123.0,US,1948-01-12,1948

In [23]:
cities_df.head(10)

       city  year  total_population
0     Akron  1940              1417
1   Alamosa  1940              5613
2      Alma  1940               469
3  Antonito  1940              1220
4    Arriba  1940               286
5    Arvada  1940              1482
6     Aspen  1940               777
7    Aurora  1940              3437
8    Basalt  1940               212
9  Bayfield  1940               372

## Categorize Cities

### Define your function

Create a function called `categorize_city_size` that does the following:

- Takes in a number that corresponds to the population for a city and returns the following based on the size of the city:
  - `Small Town` if population is less than 1,000
  - `Medium Town` if population is between 1,000 to 5,000
  - `Large Town` if population is between 5,000 to 20,000
  - `City` if population greater than or equal to 20,000

In [48]:
def categorize_city_size(city):
    if 'total_population' <= '1000':
        return("Small Town"),
    elif 'total_population' <= '5000':
        return("Medium Town"),
    elif 'total_population' <= '20000':
        return("Large Town"),
    else:
        return("City")

In [50]:
categorize_city_size('Alma')

'City'

### Test Your Function

Test out the function on a single number (`2,000`) to make sure it returns `Medium Town`

In [53]:
categorize_city_size('2000')

'City'

### Apply the function

- Take your `cities_df` dataframe and add a new column called `city_category` that applies your function to the `total_population` column of the dataframe.
- _Hint: use `apply()`_
- Show the first 10 rows of your dataframe to make sure it worked

In [56]:
cities_df['city_category']=cities_df['total_population'].apply(categorize_city_size)

In [58]:
cities_df.head(10)

       city  year  total_population city_category
0     Akron  1940              1417          City
1   Alamosa  1940              5613          City
2      Alma  1940               469          City
3  Antonito  1940              1220          City
4    Arriba  1940               286          City
5    Arvada  1940              1482          City
6     Aspen  1940               777          City
7    Aurora  1940              3437          City
8    Basalt  1940               212          City
9  Bayfield  1940               372          City

## Analyze Businesses by Year

Let's take a look at how many new businesses were formed in Colorado in each year during the 1940s:

### Calculate new businesses by year

Create a variable called `businesses_per_year` by:

- Counting the number of new businesses based on `year_entity_formed`
- _Hint: use `value_counts()` and `reset_index()`_
- Show the first 10 rows of your dataframe

In [66]:
businesses_df['year_entity_formed'.valuecounts()]

AttributeError: 'str' object has no attribute 'valuecounts'

### Visualize new businesses by year

Create a bar chart using Plotly Express showing new businesses per year:

- Set x-axis to the year
- Set y-axis to the number of new businesses
- Add an appropriate title and labels
- Display text on each bar
- Hint: Use `px.bar()`

In [ ]:
#Your code here

## Analyze Businesses by City

Let's take a look at how many new businesses were formed in each Colorado city during the 1940s:

## Calculate number of new businesses by city

Create a new variable called `city_businesses` that contains:

- A dataframe with counts of the number of new businesses in each city
- _Hint: Use `value_counts()` and `reset_index()`_
- Show the first 10 rows of your dataframe

In [ ]:
#Your code here

## Visualize new businesses by city

Create a bar chart with Plotly Express showing the top 10 cities with the most new businesses created during the 1940s:

- Filter to only show the top 10 cities (hint: use `.head()`)
- Set x-axis to `city`
- Set y-axis to `count`
- Add an appropriate title and labels

In [ ]:
#Your code here

## Combine Business and City Data

We have two datasets, both of which contain information about Colorado cities. Let's combine the two into a single dataframe that contains both information about new businesses and their population in the 1940 census.

### Merge dataframes

Merge the two dataframes together:

- Create a new variable called `merged_df`
- Use `pd.merge()` on the `city_businesses` and `cities_df` dataframes
- Figure out which column is shared between the two to use as your "key" to merge them
- ⚠️ **Note: use the `how='inner'` parameter for your merge**
- Show the first 10 rows of your new dataframe

In [ ]:
#Your code here

### Filter out missing values

You'll note that several rows of data contain `NaN` or missing values - this means that there was a city listed in the businesses dataframe but it didn't have a corresponding match in the population dataframe. For now, remove these from the `merged_df` dataframe:

- Filter out rows where `total_population` is NaN
- _Hint: use a filter + `.notna()`_

In [ ]:
#Your code here

### Calculate new businesses on a per capita rate

To make it easier to compare larger cities with smaller cities, you're going to calculate a new column for each city: the number of new businesses per 1,000 residents.

- Add a new column to `merged_df` called `biz_per_thousand` that is filled with:
  - A calculation dividing the `count` column by the `total_population` column and multiplying by 1,000
- Sort the merged dataframe by `biz_per_thousand` in descending order
- Show the first 10 rows of the dataframe to check if it worked

In [ ]:
#Your code here

## Visualize new business creation by city

Let's say we want to see the cities with the highest _rate_ of business creation (ie. new businesses per thousand residents)

- Create a bar chart in Plotly of `merged_df`:
  - Filter to only show the top 10 cities (use `.head(10)`)
  - Set x-axis to `city`
  - Set y-axis to `biz_per_thousand`
  - Use `city_category` for color
  - Add an appropriate title and labels

In [ ]:
#Your code here

## Bonus: New businesses by city category

Let's say we want to compare different size categories to see whether new businesses were cropping up in smaller places or bigger cities.

### Create a new dataframe

First, you'll need to create a new dataframe that consists of four rows, with each row a different category of city containing the total number of businesses created within that category of city.

- Create a new dataframe called `city_category_totals`
- Start with `merged_df`
- Group by `city_category`
- Add up (`sum()`) the `count` column
- Use `.reset_index()`

In [ ]:
#Your code here

### Visualize businesses by city category

- Create a [pie chart](https://plotly.com/python/pie-charts/) in Plotly:

  - Use `px.pie()` with appropriate parameters
  - Use `city_category_totals` as your dataframe
  - Use `count` for your values
  - Use `city_category` for your names
  - Add an appropriate title and labels

In [ ]:
#Your code here

## Bonus Challenge: Create a Scatterplot

Create a scatter plot in Plotly showing:

- The relationship between city population (x-axis) and new businesses (y-axis)
- Only data for towns with a population of 2,000 or more people.
- Dots sized according to the number of new businesses in that city
- Dots colored according to their size category

In [ ]:
#Your code here

## Submission Guidelines

- Run all code cells and make sure it is outputting without errors
- Submit both the notebook file (.ipynb) and a PDF export of your notebook [on Canvas](https://ucdenver.instructure.com/courses/552717/assignments/1932039)
- Note: the PDF probably won't display the Plotly figures - that's okay